examplesOld/graphql-api-server/graphql.yml
config:
  target: 'http://localhost:4000/'
  phases:
    - duration: 60
      arrivalRate: 25
scenarios:
  - name: 'Create, update, and delete a user from the database'
    flow:
      - post:
          url: /
          json:
            query: "mutation CreateUserMutation($createUserInput: UserInput) {\n\tcreateUser(input: $createUserInput) {\n\t\tid\n\t}\n}"
            variables:
              createUserInput:
                username: '{{ $randomString() }}'
                email: 'user-{{ $randomString() }}@artillery.io'
          capture:
            json: $.data.createUser.id
            as: userId
      - post:
          url: /
          json:
            query: "query UserQuery($userId: ID!) {\n\tuser(id: $userId) {\n\t\tusername\n\t\temail\n\t}\n}"
            variables:
              userId: '{{ userId }}'
      - post:
          url: /
          json:
            query: "mutation UpdateUserMutation($userId: ID!, $updateUserInput: UserInput) {\n\tupdateUser(id: $userId, input: $updateUserInput) {\n\t\tusername\n\t\temail\n\t}\n}"
            variables:
              userId: '{{ userId }}'
              updateUserInput:
                email: 'user-{{ $randomString() }}@artillery.io'
      - post:
          url: /
          json:
            query: "mutation DeleteUserMutation($userId: ID!) {\n\tdeleteUser(id: $userId) {\n\t\tid\n\t}\n}"
            variables:
              userId: '{{ userId }}'